admin_panel/ADMIN_CURRENCY_LIST_EDITING_DELECTION_TESTING/admin_currency_list_editing _DELECTION_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_currency_list_editing _DELECTION_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_currency_list_editing _DELECTION_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_currency_list_editing _DELECTION_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/Currencylist)
      - clickByLinkText(Edit)
      - clickByID(Currency)
      - typeByID(Currency): "pakistani rupees"
      - typeByID(Symbol): "pal"
      - typeByID(Buying): "1.5"
      - typeByID(Selling): "2"
      - clickByID(Symbol)
      - typeByID(Symbol): "pak"
      - clickByCSS(input.btn.btn-default)
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByCSS(button.btn.btn-primary.delete-row)
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete it permanently ? ":""')

  admin_currency_list_editing _DELECTION_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/CurrencyEdit/6'
            method: GET
            label: 'http://localhost:33143/Administator/CurrencyEdit/6'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/Currencylist'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABS4zysbczr6VM%2FMdxiUR%2BTn9z5QCb%2FQ5Iml%2FE9Z2VsYgAAAAAOgAAAAAIAACAAAADgqUYR5V%2F2VUtdehuPWXHPI2SF8gPwhBmaCVfVYdI3QjAAAAAlwDABXd6shGBKYhDW33e%2BWeyMiIRzZiwT0rwic2wuWabukz1v8LjEP5jwIWYOjTRAAAAAgwJfGYOhjDUOYrfby4AOf8BMrR6cwf9eLuDi4scws5lXRSWFriDSk4m8fDgTC578BadmTG3XpqRuy4YqffiHGg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FCurrencylist&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABS4zysbczr6VM%2FMdxiUR%2BTn9z5QCb%2FQ5Iml%2FE9Z2VsYgAAAAAOgAAAAAIAACAAAADgqUYR5V%2F2VUtdehuPWXHPI2SF8gPwhBmaCVfVYdI3QjAAAAAlwDABXd6shGBKYhDW33e%2BWeyMiIRzZiwT0rwic2wuWabukz1v8LjEP5jwIWYOjTRAAAAAgwJfGYOhjDUOYrfby4AOf8BMrR6cwf9eLuDi4scws5lXRSWFriDSk4m8fDgTC578BadmTG3XpqRuy4YqffiHGg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FCurrencylist&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/Currencylist'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/CurrencyEdit/6'
            body:
              requestUrl: 'http://localhost:33143/Administator/CurrencyEdit/6'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070749267'
          - url: 'http://localhost:33143/__browserLink/requestData/a8cb0b45d1d44ba0a5ce159f156d1757'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/a8cb0b45d1d44ba0a5ce159f156d1757'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/CurrencyEdit/6'
          - url: 'http://localhost:33143/Administator/EditSave'
            method: POST
            label: 'http://localhost:33143/Administator/EditSave'
            think-time: 23241ms
            headers:
              Origin: 'http://localhost:33143'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/CurrencyEdit/6'
            body:
              Buying: '1.5'
              Currency: pakistani rupees
              Currency_ID: '6'
              Selling: '2'
              Symbol: pak
              __RequestVerificationToken: JGwfFpJTmnCCYibB-liZbnLbHBrm3KO98mUaT_q5gkJz1CwF6TJJR666JsmtfgSpkkhL-DCRBo7dAKgB8ht1qRH_s2vTBN836zeQNMtgEAc1
          - url: 'http://localhost:33143/Administator/Currencylist'
            method: GET
            label: 'http://localhost:33143/Administator/Currencylist'
            think-time: 24ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/CurrencyEdit/6'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAA7gTtobozHsInwjuXrmraISLVkH3Z6QBYrKDa5t%2Bo9RAAAAAAOgAAAAAIAACAAAAAV7ewVhcjit%2FltqaKVEVhPCQ5JSRb6786Nm2k45DImsTAAAAD5OTUHLRHiNM22RUXXWAOJB98q7UCxqZgpVG%2Fe5eFGKEx6Jspux9jeQOtqIcmxmklAAAAAq8nEVq2ilVC95BVpXGdogHnKaHDqTGmOUXFxxRW%2BJkDUmsE9GZxLoobSon7eR3%2F6cwFPbTqvOODS%2BUQX%2FEcIXg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FCurrencyEdit%2F6&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAAA7gTtobozHsInwjuXrmraISLVkH3Z6QBYrKDa5t%2Bo9RAAAAAAOgAAAAAIAACAAAAAV7ewVhcjit%2FltqaKVEVhPCQ5JSRb6786Nm2k45DImsTAAAAD5OTUHLRHiNM22RUXXWAOJB98q7UCxqZgpVG%2Fe5eFGKEx6Jspux9jeQOtqIcmxmklAAAAAq8nEVq2ilVC95BVpXGdogHnKaHDqTGmOUXFxxRW%2BJkDUmsE9GZxLoobSon7eR3%2F6cwFPbTqvOODS%2BUQX%2FEcIXg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FCurrencyEdit%2F6&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/CurrencyEdit/6'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/Currencylist'
            body:
              requestUrl: 'http://localhost:33143/Administator/Currencylist'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070775645'
          - url: 'http://localhost:33143/__browserLink/requestData/97edbf0f55ac45f0b172c6c367d41356'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/97edbf0f55ac45f0b172c6c367d41356'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/Currencylist'
          - url: 'http://localhost:33143/Administator/CurrencyDelete/6'
            method: GET
            label: 'http://localhost:33143/Administator/CurrencyDelete/6'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/Currencylist'